# задание 1
# a = 1
# b = 2
# a = a + b
# b = a - b
# a = a - b
# print("a:", a)
# print("b:", b)

# задание 2
# a = int(input("Введите число: "))
# b = int(input("Введите число: "))
# c = int(input("Введите число: "))
# d = int(input("Введите число: "))
# z = (a + b) / (c + d)
# print("Результат :", "%.2f" % z)
# print("Результат :", round(z, 2))
# про фиксированное кол-во чисел после запитой нашел в интернете

# задание 3
# a = int(input("Введите пятизначное число: "))
# b = a % 10  # остаток от деления
# print(b)
# a = a // 10  # целая часть от деления
# print(a)
# c = a % 10
# print(c)
# a = a // 10
# print(a)
# d = a % 10
# print(d)
# a = a // 10
# print(a)
# e = a % 10
# print(e)
# a = a // 10
# print(a)
# f = a % 10
# print(f)
# z = b * c * d * e * f
# print("Произведение цифр данного числа: ", z)
# y = (b + c + d + e + f) / 5
# print("Среднее арифметическое данного числа: ", y)
