# задание 1 поиск заданного элемента в кортеже
# r = ('ab', 'adcd', 'cde', 'abc', 'def')
# print('Исходный кортеж: ', r)
# s = input('s = ')
# if s in r:
#     print('Yes')
# else:
#     print('No')

# вопросы к первому заданию
# 1) a = {print('Yes') if s == i else print('No') for i in r} не понимаю как записать в таком формате
# программа применяет из-за цикла условие к каждому элементу картежа


# задание 2 введение статистики частотности символов в кортеже
# a = input('Введите по порядку, без пробелов, элементы кортежа:')
# b = tuple(a)
# print(b)
# print('Количество 2 =', b.count('2'))
# print('Количество 5 =', b.count('5'))
# print('Количество 3 =', b.count('3'))
# print('Количество 6 =', b.count('6'))
# print('Количество 1 =', b.count('1'))

# вопросы ко второму заданию
# вопросов нет
