# import random
# print("Если устанете угадывать число, то напишите 0")
# i = 0
# a = random.randint(1, 100)
# print(a)
# while True:
#     b = int(input("Введите число: "))
#     if b == 0:
#         print("Количество попыток: ", i, "Повезёт в следующий раз")
#         break
#     if a > b:
#         print("Число меньше загаданного")
#     elif a == b:
#         print("Вы угадали) Количество попыток", i+1)
#         break
#     else:
#         print("Число больше загаданного")
#     i += 1
# про random в интернете прочитал
